#1) კომენტარებით ახსენით რას აკეთებს if და else.

#2) მომხმარებელს შემოატანინეთ ასაკი და ამის მიხედვით დაბეჭდეთ ეს:
  ##სხვა შემთხვევაში დაპრინტე "შენ ხარ ... წლის და ხარ სრულწლოვანი"

#3) მომხმარებელს შემოატანინეთ რიცხვი, შემდეგ შეამოწმეთ: 
 # თუ რიცხვი იქნება ლუწი დაპრინტეთ "... არის ლუწი",
  #სხვა შემთხვევაში დაპრინტეთ "... არის კენტი".

#4) გადახედეთ ჩანაწერს.

#5) გადახედეთ რესურსებს.

#6) გაიარეთ sololearn:

#1) კომენტარებით ახსენით რას აკეთებს if და else.

 # if და else გავიგოთ ესა თუ ის  კოდი სწორია არის თუ არა 
# და თუ if-ი არ არის სწორი მაშინ else-ს  გაუშვებს  




#2) მომხმარებელს შემოატანინეთ ასაკი და ამის მიხედვით დაბეჭდეთ ეს:
  ##სხვა შემთხვევაში დაპრინტე "შენ ხარ ... წლის და ხარ სრულწლოვანი"
 

age=int( input( ' enter your age:')) 
if age < 18:
    print('your are underage') 
else:
    print('adult')





#3) მომხმარებელს შემოატანინეთ რიცხვი, შემდეგ შეამოწმეთ: 
 # თუ რიცხვი იქნება ლუწი დაპრინტეთ "... არის ლუწი",
  #სხვა შემთხვევაში დაპრინტეთ "... არის კენტი".



name=int( input( 'enter your namber ')) 
if name % 2 ==0: 
     print ('nam არის ლუწი even ')
else:
    print('nam არის კენტი  odd  ')