#1) ჩამოწერეთ და თქვენი სიტყვებით ახსენით ყველა დღეს ნასწავლი სტრინგის ფუნქცია
#პასუხი:
#1 upeer()-მასში ჩაწერილ სიტყვას ადიდებს  
#2 lower()-მაში ჩაწერილ სიტყას პატარად აცენს
#3 capitalize()-1 ასოს აჩენს დიდად და სხვებს აპატარავეს
#4 title-ყოველი სიტვის პირველ  ასოს ადიდებს და დანარჩნს აპატარავებს

#2) მოიძიეთ ინფორმაცია ამ სტრინგის ფუნქციებზე:
#split()
#join()
#startswith() 
#endswith()
#პასუხი:
#split() ყოფს ტექსტს ნაწილებად,
#join() აერთიანებს სიას ერთ ტექსტად
#startswith() ამოწმებს იწყება თუ არა ტექსტი კონკრეტული სიტყვით, 
#endswith() ამოწმებს მთავრდება თუ არა ის ამ სიტყვით.
#როცა მოიძიებთ, ახსენით თქვენი სიტყვებით თუ რას აკეთებს თითოეული და თითო მაგალითიც მოიყვანეთ.




