#1) კომენტარებით ახსენით რას აკეთებს if, elif, else;

#if,elif,else; აქედან ყველა მათგანი ამოჭმებს მომხმარებლის შემოტანილ ასაკს სწორიათუ არა    


#2) კომენტარებით ახსენით რას განსხვავებაა if-else-სა და if-elif-else-ს შორის;

# ამათ შორის ის განსხვაბება რომ if ამოწმებს პირობას  elif ესეც პირობას ამოწმებს  მაგრამ  elif შეგვიჯლია ბევჯერ დავწეროტ დაifკი არა
#და else არის სხვაშემთხვევაში 


#4) დაწერე პროგრამა, რომელიც მომხმარებლისგან შემოიტანს სტუდენტის მიღებულ ქულას (0-დან 100-მდე) და if-else პირობით გამოიტანს შესაბამის ნიშანს შემდეგი წესით:
'ქულა'        'ნიშანი'
90 – 100      A
80 – 89       B
70 – 79       C
60 – 69       D
0 – 59        F
num = int(input("შემოიყვანე შენი გამოცდის ქულა : "))

if num >= 90 and num <= 100:
    print("A")
elif num >= 80 and num <= 89:
    print("B")
elif num >= 70 and num <= 79:
    print("C")
elif num >= 60 and num <= 69:
    print("D")
else:
    print("F")