#კომენტარებით ახსენით რას აკეთებს თითოეული:
# აქიდან ყველა ამოწრის საიდან სანამდეც მონიშნულია

#print(name[0:3])
#print(name[2:])
#print(name[:4])
#print(name[-1])

#რას აკეთებს პირველი ინდექსი სლაისინგის ფრჩხილებში - []
#იგი ამოწმებს ყველაფერს და გადაცემუ ამოცანას აკეთებს და მისი ამოცაანაა რომ მოცემული სიტყვები ამოჭრას 


#როგორ მუშაობს უარყოფითი ინდექსი
#პროგრამირებაში (მაგალითად, Python) უარყოფითი ინდექსი გამოიყენება სიის ან სტრიქონის ელემენტების ბოლოდან საათვლელად. ის იწყება -1-დან ბოლო ელემენტისთვის და მცირდება პირველისკენ.

#შექმენით სია, სადაც შეინახავთ 7 ქალაქს:

#მაგალითად:

#cities = ["Tbilisi", "Batumi", "Kutaisi", "Rustavi", "Gori", "Zugdidi", "Poti"]

#დაპრინტეთ:
#მე-3 ელემენტიდან მე-6 ელემენტის ჩათვლით ქალაქები
print("cities"[3:6])

#მომხმარებელს შემოატანინეთ სახელი, შემდეგ კი დაბეჭდეთ: პირველი 2 ასოს გარეშე დარჩენილი სახელი
#Input: 
# Jemali
#Output: mali
name = input("enter your name:")

print(name[2:]) 

#მომხმარებელს შემოატანინეთ პაროლი.

#თუ პაროლის პირველი ასო არის "A": დაბეჭდეთ: Correct

#სხვა შემთხვევაში: Wrong

password = input("enter your password: ")

if password[0] == "A":
    print("Correct")
else:
    print("Wrong")

    #შექმენით რიცხვების სია:

#numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

#თქვენი დავალებაა, რომ დაპრინტოთ სიის ეს ნაჭერი სლაისინგის გამოყენებით:

#[4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

print(numbers[3:14])