#1) კომენტარებით ახსენით დღეს ნასწავლი ყველა სიის მეთოდი და მოიყვანეთ თითო მაგალითი
#N1
#len-ის ვიყენებთ რომ დავითვალოტ რამხელა სიგრძეში სია და ასევე რამდენი ელემენტია
#მაგალითი:
my_list= ["niko","batoni sio","batoni demetre"]
count = 0
for i in my_list:
    if type(i) == str:
        count += len(i)

#N2 apennd მეთოდს ვიყენებთ რომ უკვე გაკეტებულ სიაში დავამატოთ ახალი ელემეNტი
#მაგალითი:
my_list= ["niko","batoni sio","batoni demetre"]
my_list.append("nini") 

#N3
#insert გვეხმარება რომ როდესაც რამეს დავამატებთ  მაგის შემდეგ სხვა ადგილას გადავიყვანთ
#მაგალითი:
genres = ["Sci-Fi", "Fantasy", "Drama"]
genres.insert(3, "nini")

#Npop მეთოდის საშვალებით შეგვიძლია რომელი ელემენტიც გვინდა  ის ამოვაგდოთ
#მაგალითი: