# ჩვენ ვიცით 6 შედარების ოპერეტორები ესენია >,<,<=,>=,!=,==    #N1

#> მეტობა
print(450>200)
print(1000>800)  

#< ნაკლებობა
print(10000<20000)
print(0<280) 

#>= მეტია ან ტროლია 
print(20>=10) 
print(90>=90) 
 
 #<= ნაკლებია ან ტოლია
print(10<=20)  
print(7<=7) 

#!= არ არის ტოლი 
print(10!=12) 

#== ტოლია  
print(10==10) 
print(20==20)  

#N2 
# ჩვენ ვიცით 2 ლოგოკური ოპერატორები ესენია  or ,and

print(100>10 or 200<100)
print( 900>=900 or 900>=900)

print(1000==1000 and 200==200)
print(3000<=2000 and 350<=40)   

#N3 
# იმიტომ გამოიტანს ეს კოდი false რომ  სტრინგს  ემატება ინტეჯერი და ეგ არ შეიძლება ეგ   სტრინგს არ ემატება ინტეჯერი

num1 = "21"
num2 = 21
print(num1 == num2)   

# ეს კოდი გამოიტანს  true  
#  False or True  

#  ეს კოდი გამოიტანს   false
    # True and False   